// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// НЕ ИСПОЛЬЗОВАТЬ MATH.POW
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

Console.Clear();
Console.Write("Введите число:");
int n = Convert.ToInt32(Console.ReadLine());
Console.Write("Введите степень:");
int m = Convert.ToInt32(Console.ReadLine());
Console.Write($"Результат");

int[] array = int [int m];

for (int i = 0; i < array.Length; i++)
{
    
}
 Console.WriteLine($"res");